var spigot = require("stream-spigot")

var faces = [
  "ヽ༼ຈل͜ຈ༽ﾉ",
  "(ง°ل͜°)ง",
  "༼ つ ಥ_ಥ ༽つ",
  "ᕙ༼ຈل͜ຈ༽ᕗ",
  "~(˘▾˘~)",
  "ɳ༼ຈل͜ຈ༽ɲ",
  "༼ʘ̚ل͜ʘ̚༽",
  "ʕ•ᴥ•ʔ",
  "༼ ͡■ل͜ ͡■༽",
  "(ง ͠° ل͜ °)ง",
  "༼ ºل͟º ༽",
  "༼ つ ◕_◕ ༽つ",
  "(ง ͠° ͟ل͜ ͡°)ง",
  "(ง ͠ ͠° ͟ل͜ ͡°)ง",
  "ヽ( ͝° ͜ʖ͡°)ﾉ",
  "(ง •̀_•́)ง",
  "༼ ºل͟º༼",
  "༼ ºل͟º༽",
  "(ง'̀-'́)ง",
  "ヽ༼Ὸل͜ຈ༽ﾉ",
  "( ° ͡ ͜ ͡ʖ ͡ °)",
  "༼ ºººººل͟ººººº ༽",
  "ζ༼Ɵ͆ل͜Ɵ͆༽ᶘ",
  "ヽ༼ʘ̚ل͜ʘ̚༽ﾉ",
  "( ° ͜ ʖ °)",
  "(̿▀̿ ̿Ĺ̯̿̿▀̿ ̿)̄",
  "(ง⌐□ل͜□)ง",
  "ლ(́◉◞౪◟◉‵ლ)",
  "ヽ༼ຈل͜ຈ༽ง",
  "Ѱζ༼ᴼل͜ᴼ༽ᶘѰ",
  "(ง ͡ʘ ͜ʖ ͡ʘ)ง",
  "ヽ༼° ͟ل͜ ͡°༽ﾉ",
  "(ง ͠° ͟ل͜ ͡°)ง",
  "ง ͠° ل͜ °)ง",
  "(っ◕‿◕)っ",
  "( ͝° ͜ʖ͡°)",
  "(ง •̀_•́)ง",
  "ლ(ಠ益ಠლ)",
  "(╯°□°)╯",
  "(⊙ω⊙)",
  "( ︶︿︶)",
  "ᕕ( ᐛ )ᕗ",
  "(ノ・∀・)ノ",
  "(｀◔ ω ◔´)",
  "ᶘ ᵒᴥᵒᶅ",
  "ಠ_ಠ",
  "t(-.-t)",
  "‎‎(ﾉಥ益ಥ）ﾉ",
  "ノ( ゜-゜ノ)",
  "| (• ◡•)|",
  "(❍ᴥ❍ʋ)",
  "¯\_(ツ)_/¯"
]

module.exports = function() {
  return faces[Math.floor(Math.random() * faces.length)]
}

module.exports.faces = faces

module.exports.faceStream = function() {
  return spigot(faces)
}
